[출처 : 빅데이터 & 인공지능 by Data Chan_ge](https://chan123.tistory.com/48?category=943438)

In [1]:
import pandas as pd
import numpy as np

In [2]:
# 시리즈 생성
s = pd.Series([1,2,3,4,5]);s
# 왼쪽에 순서?를 알려주는 인덱스(index)라는 것이 자동으로 생성되어 표시된다.

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
s = pd.Series([1,3,5, np.nan, 6, 8]);s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [21]:
# date_range
# 판다스의 date_range 메소드를 사용해 20130101부터 기간(periods) 6만큼 데이터범위 생성
dates = pd.date_range('20210801', periods=6)

print(type(dates))
dates

<class 'pandas.core.indexes.datetimes.DatetimeIndex'>

DatetimeIndex(['2021-08-01', '2021-08-02', '2021-08-03', '2021-08-04',
               '2021-08-05', '2021-08-06'],
              dtype='datetime64[ns]', freq='D')

In [17]:
# 데이터 프레임 생성
# df = pd.DataFrame(값(data), [index], [columns], 기타 옵션)
# df = dataframe

# 값에 딕셔너리 형태(키: 값) 사용
# 스칼라만 사용하면 반드시 index를 지정해줘야 한다.
df = pd.DataFrame({'A':1, 'B':2}, index=['0', '1'])
df

# 값에 numpy를 이용한 랜덤값 삽입
df = pd.DataFrame(np.random.randn(2,3))
df

          0         1         2
0  0.434940 -0.127297  1.698685
1  2.164455  0.032012  0.248813

In [22]:
# DataFrame 옵션 
# index : 행의 이름을 지정하는 것, 인덱스 값으로는 리스트 형태를 사용한다. 
# None이나 pd.date_range도 사용가능
# 인덱스로 None을 사용할 경우 1행부터 순서대로 0,1,2...순으로 채워진다.

# columns : 열 이름을 지정
# dtype : float32 등

In [18]:
# 데이터프레임 생성 예제 
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2021-08-01  0.058498 -1.426060 -1.634101 -1.473883
2021-08-02 -0.282371  0.675639 -0.499161  0.750587
2021-08-03 -0.465056 -0.017399  0.476849  0.202802
2021-08-04 -0.702562 -0.060609 -0.359671  0.813110
2021-08-05 -1.228968  0.235554  0.643790  0.210044
2021-08-06  0.685829  0.242067 -2.341336  0.096369

In [ ]:
# pd.Timestamp('날짜') = 0000-00-00으로 전환하여 나타냄

In [28]:
df2=pd.DataFrame({
    'A':1,
    'B':pd.Timestamp('20210427'),
    'C':pd.Series(1, index=list(range(4)), dtype='float32'),
    'D':np.array([3]*4, dtype='int32'),
    'E':pd.Categorical(['train', 'test', 'train', 'test']),
    'F':'fooo'
})

df2
# A, F - 값을 행렬 범위만큼 입력값으로 채움
# B - 타임스탬프 형식으로 2021-04-27 값 입력
# C - 시리즈 형식으로 값 1 인덱스0~4 데이터타입은 float32
# D - np.array로 배열(리스트) 입력 : [3, 3, 3, 3]
# E - 카테고리 형식 데이터 입력

   A          B    C  D      E     F
0  1 2021-04-27  1.0  3  train  fooo
1  1 2021-04-27  1.0  3   test  fooo
2  1 2021-04-27  1.0  3  train  fooo
3  1 2021-04-27  1.0  3   test  fooo

In [29]:
# info : 주로 Null값을 찾을때 사용
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
dtypes: category(1), datetime64[ns](1), float32(1), int32(1), int64(1), object(1)
memory usage: 420.0+ bytes

In [30]:
# dtypes 
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [32]:
# viewing data(데이터 확인)
# 처음 n개 행을 불러옴
# 미입력시 처음 5줄을 불러옴
df.head()

                   A         B         C         D
2021-08-01  0.058498 -1.426060 -1.634101 -1.473883
2021-08-02 -0.282371  0.675639 -0.499161  0.750587
2021-08-03 -0.465056 -0.017399  0.476849  0.202802
2021-08-04 -0.702562 -0.060609 -0.359671  0.813110
2021-08-05 -1.228968  0.235554  0.643790  0.210044

In [33]:
# 마지막 n개의 줄을 불러옴
df.tail()

                   A         B         C         D
2021-08-02 -0.282371  0.675639 -0.499161  0.750587
2021-08-03 -0.465056 -0.017399  0.476849  0.202802
2021-08-04 -0.702562 -0.060609 -0.359671  0.813110
2021-08-05 -1.228968  0.235554  0.643790  0.210044
2021-08-06  0.685829  0.242067 -2.341336  0.096369

In [34]:
# 열에 대한 정보를 불러옴
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [36]:
# 값 정보 출력
df.values

array([[ 0.05849825, -1.42606027, -1.63410074, -1.47388283],
       [-0.28237105,  0.6756393 , -0.49916085,  0.75058661],
       [-0.46505551, -0.01739901,  0.476849  ,  0.20280171],
       [-0.70256168, -0.06060926, -0.35967102,  0.81311045],
       [-1.22896811,  0.2355537 ,  0.6437899 ,  0.21004399],
       [ 0.68582924,  0.24206739, -2.34133622,  0.09636878]])

In [37]:
# 행과 열 변경(전치)
df.T

   2021-08-01  2021-08-02  2021-08-03  2021-08-04  2021-08-05  2021-08-06
A    0.058498   -0.282371   -0.465056   -0.702562   -1.228968    0.685829
B   -1.426060    0.675639   -0.017399   -0.060609    0.235554    0.242067
C   -1.634101   -0.499161    0.476849   -0.359671    0.643790   -2.341336
D   -1.473883    0.750587    0.202802    0.813110    0.210044    0.096369

In [40]:
# sort_index : 행 또는 열 기준으로 오름/내림차순 정렬
# axis=0 : 행 / axis=1 : 열
# ascending=True : 오름차순 / ascending=False : 내림차순
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2021-08-01 -1.473883 -1.634101 -1.426060  0.058498
2021-08-02  0.750587 -0.499161  0.675639 -0.282371
2021-08-03  0.202802  0.476849 -0.017399 -0.465056
2021-08-04  0.813110 -0.359671 -0.060609 -0.702562
2021-08-05  0.210044  0.643790  0.235554 -1.228968
2021-08-06  0.096369 -2.341336  0.242067  0.685829

In [43]:
# sort_values 
# 특정 컬럼의 값을 기준으로 정렬
df.sort_values(by='B', ascending=False)

<bound method DataFrame.sort_values of                    A         B         C         D
2021-08-01  0.058498 -1.426060 -1.634101 -1.473883
2021-08-02 -0.282371  0.675639 -0.499161  0.750587
2021-08-03 -0.465056 -0.017399  0.476849  0.202802
2021-08-04 -0.702562 -0.060609 -0.359671  0.813110
2021-08-05 -1.228968  0.235554  0.643790  0.210044
2021-08-06  0.685829  0.242067 -2.341336  0.096369>

In [45]:
# describe() : 통계정보 출력(개수, 평균, 최소, 최대, 표준편차, 분위수)
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.322438 -0.058468 -0.618938  0.099838
std    0.655736  0.719400  1.172519  0.828443
min   -1.228968 -1.426060 -2.341336 -1.473883
25%   -0.643185 -0.049807 -1.350366  0.122977
50%   -0.373713  0.109077 -0.429416  0.206423
75%   -0.026719  0.240439  0.267719  0.615451
max    0.685829  0.675639  0.643790  0.813110

In [46]:
# Selection (선택)
# getting
df['A']

# 열 A에 대한 값을 선택한다.
# 단일 열을 선택할 경우 Series가 된다.

2021-08-01    0.058498
2021-08-02   -0.282371
2021-08-03   -0.465056
2021-08-04   -0.702562
2021-08-05   -1.228968
2021-08-06    0.685829
Freq: D, Name: A, dtype: float64

In [49]:
# [ ] 를 사용해 행을 분할
df[0:3]

                   A         B         C         D
2021-08-01  0.058498 -1.426060 -1.634101 -1.473883
2021-08-02 -0.282371  0.675639 -0.499161  0.750587
2021-08-03 -0.465056 -0.017399  0.476849  0.202802

In [63]:
# Selection by label : loc[] : 행, 열의 이름으로 선택
df.loc[dates[0]]
df.loc[:, ['A','B']]
df.loc['20210802':'20210804', ['A','B']]
df.loc['20210802', ['A','B']]
df.loc[dates[0], 'A']

# at은 loc와 동일하게 사용하는데 loc을 주로 사용
df.at[dates[0], 'A']

0.058498253984628774

In [77]:
# Selection by position : iloc[] : 행, 열의 번호로 선택
df.iloc[3]
df.iloc[3:5, 0:2] #[행.열]
df.iloc[[1,2,4], [0,2]]
df.iloc[1:3, :]
df.iloc[:, 1:3]
df.iloc[1,1]

# iat은 iloc와 동일, iloc주로 사용
df.iat[1,1]

0.6756392998221012

In [80]:
# Boolean indexing : 조건에 맞는 값 가져오기
df3 = pd.DataFrame({
    'A':[1,2,3],
    'B':[4,5,6]
}, index=list('AA BB CC'.split()))
df3

    A  B
AA  1  4
BB  2  5
CC  3  6

In [81]:
df3 > 2

        A     B
AA  False  True
BB  False  True
CC   True  True

In [82]:
df3[df3 > 2]

      A  B
AA  NaN  4
BB  NaN  5
CC  3.0  6

In [84]:
#isin : 안에 있냐 True or False
df3[df3.isin([4,6])]

     A    B
AA NaN  4.0
BB NaN  NaN
CC NaN  6.0

In [99]:
# setting 

# 1~6까지 series를 만드는데 index는 pd의 날짜형식의 범위를 가져옴. 20210801부터 6개뽑는다.
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20210802', periods=6) )
s1

2021-08-02    1
2021-08-03    2
2021-08-04    3
2021-08-05    4
2021-08-06    5
2021-08-07    6
Freq: D, dtype: int64

In [100]:
# 새로운 열에 추가
# 새 열을 설정하면 인덱스별로 데이터가 정렬된다.
df['F']=s1

In [108]:
# loc나 iloc를 사용하여 특정 위치에 있는 값을 변경할 수 있다.
# 리스트에 숫자를 곱하면 그 수만큼 요소 생성
# 이미 있는 열이라면 값 변경 
df.loc[:,'D'] = np.array([5]*len(df));df

                   A         B         C  D    F
2021-08-01  0.058498 -1.426060 -1.634101  5  NaN
2021-08-02 -0.282371  0.675639 -0.499161  5  1.0
2021-08-03 -0.465056 -0.017399  0.476849  5  2.0
2021-08-04 -0.702562 -0.060609 -0.359671  5  3.0
2021-08-05 -1.228968  0.235554  0.643790  5  4.0
2021-08-06  0.685829  0.242067 -2.341336  5  5.0

In [112]:
df[df >0] = df
df

                   A         B         C  D    F
2021-08-01  0.058498 -1.426060 -1.634101  5  NaN
2021-08-02 -0.282371  0.675639 -0.499161  5  1.0
2021-08-03 -0.465056 -0.017399  0.476849  5  2.0
2021-08-04 -0.702562 -0.060609 -0.359671  5  3.0
2021-08-05 -1.228968  0.235554  0.643790  5  4.0
2021-08-06  0.685829  0.242067 -2.341336  5  5.0

In [115]:
# Missing data ( 결측치 )
# reindex를 사용해 지정된 축의 인덱스를 변경, 추가, 삭제할 수 있다.
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+['E']); df1
# df를 reindex할 거다. 행은 dates의 0부터 3행까지 가져오고 
# 열은 기존 열에 E까지 가져온다.

                   A         B         C  D    F   E
2021-08-01  0.058498 -1.426060 -1.634101  5  NaN NaN
2021-08-02 -0.282371  0.675639 -0.499161  5  1.0 NaN
2021-08-03 -0.465056 -0.017399  0.476849  5  2.0 NaN
2021-08-04 -0.702562 -0.060609 -0.359671  5  3.0 NaN

In [118]:
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    F    E
2021-08-01  0.058498 -1.426060 -1.634101  5  NaN  1.0
2021-08-02 -0.282371  0.675639 -0.499161  5  1.0  1.0
2021-08-03 -0.465056 -0.017399  0.476849  5  2.0  NaN
2021-08-04 -0.702562 -0.060609 -0.359671  5  3.0  NaN

In [119]:
# nan값이 있는 행 삭제
df1.dropna(how='any')
# df1의 데이터는 변하지 않음(비파괴적)
# dropna를 이용해 반환된 값을 다시 df1에 저장해야함
# df1 = dr1.dropna(how='any')
# 인자 how값으로 'any' 혹은 'all' 사용 가능
# 'any'는 nan값이 하나라도 있는 행을 선택하고 'all'은 행의 모든데이터가 nan인 값을 선택

                   A         B         C  D    F    E
2021-08-02 -0.282371  0.675639 -0.499161  5  1.0  1.0

In [120]:
# nan값이 있는 자리에 value 채우기
df1.fillna(value=50)

                   A         B         C  D     F     E
2021-08-01  0.058498 -1.426060 -1.634101  5  50.0   1.0
2021-08-02 -0.282371  0.675639 -0.499161  5   1.0   1.0
2021-08-03 -0.465056 -0.017399  0.476849  5   2.0  50.0
2021-08-04 -0.702562 -0.060609 -0.359671  5   3.0  50.0

In [121]:
# nan값이 있는지 확인하기
df1.isna() # pd.isna(df1)과 동일

                A      B      C      D      F      E
2021-08-01  False  False  False  False   True  False
2021-08-02  False  False  False  False  False  False
2021-08-03  False  False  False  False  False   True
2021-08-04  False  False  False  False  False   True

In [125]:
# Operations ( 연산 )
# mean(평균)
df1.mean(0)

# 0 : 열 기준(기본값)
# 1 : index 기준

A   -0.347872
B   -0.207107
C   -0.504021
D    5.000000
F    2.000000
E    1.000000
dtype: float64

In [131]:
# shift(이동)
s=pd.Series([1,3,5,np.nan, 6, 8], index=dates).shift(2) ;s 
#sfhit(n) : n만큼 이동

2021-08-01    NaN
2021-08-02    NaN
2021-08-03    1.0
2021-08-04    3.0
2021-08-05    5.0
2021-08-06    NaN
Freq: D, dtype: float64

In [133]:
# sub(빼기)
# df의 각 값들에서 s를 뺀다 
df.sub(s, axis='index')

                   A         B         C    D    F
2021-08-01       NaN       NaN       NaN  NaN  NaN
2021-08-02       NaN       NaN       NaN  NaN  NaN
2021-08-03 -1.465056 -1.017399 -0.523151  4.0  1.0
2021-08-04 -3.702562 -3.060609 -3.359671  2.0  0.0
2021-08-05 -6.228968 -4.764446 -4.356210  0.0 -1.0
2021-08-06       NaN       NaN       NaN  NaN  NaN

In [134]:
# Apply(적용)
# 누적합계
# df.apply(함수)
df.apply(np.cumsum)

# cumsum : 밑으로 가면서 합계를 누적

                   A         B         C   D     F
2021-08-01  0.058498 -1.426060 -1.634101   5   NaN
2021-08-02 -0.223873 -0.750421 -2.133262  10   1.0
2021-08-03 -0.688928 -0.767820 -1.656413  15   3.0
2021-08-04 -1.391490 -0.828429 -2.016084  20   6.0
2021-08-05 -2.620458 -0.592876 -1.372294  25  10.0
2021-08-06 -1.934629 -0.350808 -3.713630  30  15.0

In [136]:
# 각 열마다 최대값 - 최소값
df.apply(lambda x : max(x) - min(x))

A    1.914797
B    2.101700
C    2.985126
D    0.000000
F         NaN
dtype: float64

In [139]:
# Histogramming
s=pd.Series(np.random.randint(0,7,size=10));s
# 넘파이의 random.randint 메소드를 사용해 0부터 6(7-1)까지의 랜덤int값을 10개 생성한다.

0    1
1    3
2    0
3    4
4    2
5    4
6    4
7    3
8    5
9    3
dtype: int32

In [140]:
# 각 값별 개수를 반환
s.value_counts()

4    3
3    3
5    1
2    1
1    1
0    1
dtype: int64

[파이썬 문자열 처리를 위한 다양한 메소드](https://rfriend.tistory.com/327)

In [ ]:
# string Methods
# lower(), upper(), capitalize, title, swapcase, replace 등

# 문자열 정렬
# center() - 문자열 가운데 정렬. (인자로 넓이를 지정, 채울 문자 선택 가능)
# ljust() - 문자열 왼쪽 정렬
# rjust() - 문자열 오늘쪽 정렬

In [144]:
s=pd.Series(['A','B','C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat']);s
s.str.lower() #s의 문자열들을 모두 소문자로 바꿔라

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [146]:
# merge(병합)
# concat(연결)
df = pd.DataFrame(np.random.randn(7,4));df

          0         1         2         3
0  1.342351 -0.033720 -0.353934 -1.106609
1  1.248657 -0.403484 -1.398807  0.410402
2 -1.412927 -0.366345  1.307955  1.184655
3  1.363954  2.171373 -0.483499 -0.744721
4 -0.143263 -0.463003  2.373288 -2.209968
5  0.111208  0.446505  1.733453 -0.229366
6 -0.430646 -0.465071  1.800750 -0.223205

In [152]:
pieces=[df[:2],df[2:4],df[4:]]
pieces

[          0         1         2         3
 0  1.342351 -0.033720 -0.353934 -1.106609
 1  1.248657 -0.403484 -1.398807  0.410402,
           0         1         2         3
 2 -1.412927 -0.366345  1.307955  1.184655
 3  1.363954  2.171373 -0.483499 -0.744721,
           0         1         2         3
 4 -0.143263 -0.463003  2.373288 -2.209968
 5  0.111208  0.446505  1.733453 -0.229366
 6 -0.430646 -0.465071  1.800750 -0.223205]

In [153]:
pd.concat(pieces)

          0         1         2         3
0  1.342351 -0.033720 -0.353934 -1.106609
1  1.248657 -0.403484 -1.398807  0.410402
2 -1.412927 -0.366345  1.307955  1.184655
3  1.363954  2.171373 -0.483499 -0.744721
4 -0.143263 -0.463003  2.373288 -2.209968
5  0.111208  0.446505  1.733453 -0.229366
6 -0.430646 -0.465071  1.800750 -0.223205

In [157]:
# join
left =pd.DataFrame({
    'key':['foo','foo'],
    'lval':[1,2]
})
left

   key  lval
0  foo     1
1  foo     2

In [158]:
right =pd.DataFrame({
    'key':['foo','foo'],
    'rval':[4,5]
})
right

   key  rval
0  foo     4
1  foo     5

In [159]:
pd.merge(left, right, on='key') # on : 기준
# how = 'outer'는 기준 열 'Year'의 데이터의 중복 여부와 상관없이 모두 출력
# how = 'inner'를 입력하면 중복된 데이터의 행만 출력
# how = 'left' / 'right'는 각각 기준으로

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [160]:
left =pd.DataFrame({
    'key':['foo','bar'],
    'lval':[1,2]
})
left

   key  lval
0  foo     1
1  bar     2

In [163]:
right =pd.DataFrame({
    'key':['foo','bar'],
    'rval':[4,5]
})
right

   key  rval
0  foo     4
1  bar     5

In [164]:
pd.merge(left,right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [165]:
# grouping
# groupby

df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                   'C': [1,2,3,4,5,6,7,8],
                   'D': [2,3,4,5,6,7,8,9]}
                 )

In [167]:
df.groupby(['A','B']).sum()

# 여러 열을 기준으로 그룹화하면 계층적으로 인덱스가 생성된다.
# A와 B를 기준으로 그룹화하고 그룹별 합계를 반환한다.

           C   D
A   B
bar one    2   3
    three  4   5
    two    6   7
foo one    8  10
    three  8   9
    two    8  10

In [168]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [169]:
index2 = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index2

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [171]:
# 새 column 추가하기 (맨 마지막에 컬럼 추가)
df = pd.DataFrame(np.arange(16).reshape(4,4),
columns=['price','qty','price','qty'])
df

   price  qty  price  qty
0      0    1      2    3
1      4    5      6    7
2      8    9     10   11
3     12   13     14   15

In [175]:
df['name']='-'
# 끝에 name이라는 이름의 열이 추가되고 '-'값이 입력됨

   price  qty  price  qty name
0      0    1      2    3    -
1      4    5      6    7    -
2      8    9     10   11    -
3     12   13     14   15    -

In [176]:
df = pd.DataFrame(np.arange(16).reshape(4,4),
columns=['price','qty','price','qty'])
df

   price  qty  price  qty
0      0    1      2    3
1      4    5      6    7
2      8    9     10   11
3     12   13     14   15

In [177]:
# df.insert(loc, column, value, allow_duplicates=False)
df.insert(2, 'name', '-', allow_duplicates=False)
df

   price  qty name  price  qty
0      0    1    -      2    3
1      4    5    -      6    7
2      8    9    -     10   11
3     12   13    -     14   15